base/Catalogs/бит_фн_Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_фн_Оповещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Объект системы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Comment>Пользовательское условие</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Comment>Вид события</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_фн_ВидыСобытийОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза</Name>
					<Comment>Виза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Comment>Решение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыРешенийСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Comment>Шаблон сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_фн_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаДоставки</Name>
					<Comment>Настройка доставки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_фн_НастройкиДоставкиОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаАлгоритма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДляПроверки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновщика</Name>
					<Comment>Хранит настройки компоновщика</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФоновыйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьПовторно</Name>
					<Comment>Не регистрировать повторно</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
					<Comment>Получатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Comment>Вид контактной информации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеВхождения</Name>
							<Comment>Условие вхождения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Comment>Шаблон сообщения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_фн_ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаДоставки</Name>
							<Comment>Настройка доставки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_фн_НастройкиДоставкиОповещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательскоеУсловие</Name>
							<Comment>Пользовательское условие</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздаватьОбсуждение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/InformationRegisters/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПредыдущий</Name>
					<Comment>Статус предыдущий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Comment>Дата изменения статуса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Comment>Вид статуса</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСтатусовОбъектов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СостояниеОплаты</Name>
					<Comment>Состояние оплаты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_СтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатусыОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок следования статусов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Comment>Оформление</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретИзмененияВложений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_фн_Оповещения/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	// Обновляем кэш платформы для зачитывания актуальных настроек
	// оповещений процедурой бит_ОповещенияПовтИсп.ЕстьНастройкаОповещения.
	ОбновитьПовторноИспользуемыеЗначения();
		
КонецПроцедуры // ПриЗаписи()	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Получатели.Количество() = 0 Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "Заполнение",,, 
							НСтр("ru = 'Получатели'; en = 'Recipients'"));
	    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.Получатели");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Получатели.НомерСтроки КАК НомерСтроки,
	|	Получатели.Пользователь КАК Пользователь,
	|	Получатели.СоздаватьОбсуждение КАК СоздаватьОбсуждение,
	|	ВЫБОР
	|		КОГДА Получатели.НастройкаДоставки = ЗНАЧЕНИЕ(Справочник.бит_фн_НастройкиДоставкиОповещений.ПустаяСсылка)
	|			ТОГДА &НастройкаДоставкиВШапке
	|		ИНАЧЕ Получатели.НастройкаДоставки
	|	КОНЕЦ КАК НастройкаДоставки,
	|	Получатели.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации
	|ПОМЕСТИТЬ Получатели
	|ИЗ
	|	&Получатели КАК Получатели";
	Запрос.УстановитьПараметр("Получатели",              Получатели.Выгрузить());
	Запрос.УстановитьПараметр("НастройкаДоставкиВШапке", НастройкаДоставки);
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Получатели.НомерСтроки КАК НомерСтроки,
	|	Получатели.Пользователь КАК Пользователь,
	|	Получатели.СоздаватьОбсуждение КАК СоздаватьОбсуждение,
	|	Получатели.НастройкаДоставки КАК НастройкаДоставки,
	|	Получатели.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
	|	ЕСТЬNULL(СправочникНастройкиДоставки.СпособТранспорта, ЗНАЧЕНИЕ(Перечисление.бит_фн_СпособыТранспортаОповещений.ПустаяСсылка)) КАК СпособТранспорта,
	|	ТИПЗНАЧЕНИЯ(Получатели.Пользователь) КАК ТипПользователя
	|ИЗ
	|	Получатели КАК Получатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_фн_НастройкиДоставкиОповещений КАК СправочникНастройкиДоставки
	|		ПО Получатели.НастройкаДоставки = СправочникНастройкиДоставки.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
    ВыборкаПолучаетелей = Запрос.Выполнить().Выбрать();
	
	ТипыДляСистемыВзаимодействия = Новый Массив();
	ТипыДляСистемыВзаимодействия.Добавить(Тип("СправочникСсылка.Пользователи"));
	ТипыДляСистемыВзаимодействия.Добавить(Тип("СправочникСсылка.ГруппыПользователей"));
	ТипыДляСистемыВзаимодействия.Добавить(Тип("Строка"));
	
	Пока ВыборкаПолучаетелей.Следующий() Цикл
		Если (ВыборкаПолучаетелей.СоздаватьОбсуждение
			ИЛИ ВыборкаПолучаетелей.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.СистемаВзаимодействия)
			И ТипыДляСистемыВзаимодействия.Найти(ВыборкаПолучаетелей.ТипПользователя) = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Выберите пользователя, группу пользователей или строковое имя реквизита с таким типом.';
									|en = 'Select user, user group or name of an attribute with this type.'");
			Префикс = "Получатели[%1].";
			Префикс = СтрШаблон(Префикс, Формат(ВыборкаПолучаетелей.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			Поле = Префикс + "Пользователь";
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
							НСтр("ru = 'Пользователь'; en = 'User'"),
							ВыборкаПолучаетелей.НомерСтроки, НСтр("ru = 'Получатели'; en = 'Recipients'"), ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если (ВыборкаПолучаетелей.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта
			ИЛИ ВыборкаПолучаетелей.СпособТранспорта = Перечисления.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта1С)
			И НЕ ЗначениеЗаполнено(ВыборкаПолучаетелей.ВидКонтактнойИнформации) Тогда
			Префикс = "Получатели[%1].";
			Префикс = СтрШаблон(Префикс, Формат(ВыборкаПолучаетелей.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			Поле = Префикс + "ВидКонтактнойИнформации";
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "ЗАПОЛНЕНИЕ",
							НСтр("ru = 'Вид контактной информации'; en = 'Contact Information Type'"),
							ВыборкаПолучаетелей.НомерСтроки, НСтр("ru = 'Получатели'; en = 'Recipients'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция получает настройки построителя.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
Функция ПолучитьНастройкиКомпоновщика() Экспорт
	
	СтруктураНастроек = НастройкиКомпоновщика.Получить();
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		СтруктураНастроек = Новый Структура;
	КонецЕсли; 	
	
	Возврат СтруктураНастроек;
	
КонецФункции // ПолучитьНастройки()

// Процедура сохраняет настройки построителя.
// 
// Параметры:
//  СтруктураНастроек - Структура.
// 
Процедура СохранитьНастройкиКомпоновщика(СтруктураНастроек)  Экспорт
	
	НастройкиКомпоновщика = Новый ХранилищеЗначения(СтруктураНастроек);
	
КонецПроцедуры // СохранитьНастройки()

// Процедура инициализирует компоновщик, используемый для фильтрации структуры дерева.
// 
Процедура ИнициализироватьКомпоновщик(ВидСобытия, Компоновщик) Экспорт
	
	АдресКомпоновки = "";
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	// ++ ЕРП 
	Если ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.ВерсияДанных КАК ВерсияДанных,
		|	ДоговорыКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
		|	ДоговорыКонтрагентов.Наименование КАК Наименование,
		|	ДоговорыКонтрагентов.БанковскийСчет КАК БанковскийСчет,
		|	ДоговорыКонтрагентов.бит_ДержательДоговора КАК бит_ДержательДоговора,
		|	ДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
		|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ДоговорыКонтрагентов.Комментарий КАК Комментарий,
		|	ДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ДоговорыКонтрагентов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
		|	ДоговорыКонтрагентов.Менеджер КАК Ответственный,
		|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК НаименованиеДляПечати,
		|	ДоговорыКонтрагентов.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
		|	ДоговорыКонтрагентов.ВидАгентскогоДоговора КАК ВидАгентскогоДоговора,
		|	ДоговорыКонтрагентов.Дата КАК Дата,
		|	ДоговорыКонтрагентов.Номер КАК Номер,
		|	ДоговорыКонтрагентов.Партнер КАК Партнер,
		|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
		|	ДоговорыКонтрагентов.УдалитьПорядокОплаты КАК ПорядокОплаты,
		|	ДоговорыКонтрагентов.ОплатаВВалюте КАК ОплатаВВалюте,		
		|	ДоговорыКонтрагентов.ПорядокРасчетов КАК ПорядокРасчетов,
		|	ДоговорыКонтрагентов.Согласован КАК Согласован,
		|	ДоговорыКонтрагентов.Статус КАК Статус,
		|	ДоговорыКонтрагентов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора,
		|	ДоговорыКонтрагентов.ОграничиватьСуммуЗадолженности КАК ОграничиватьСуммуЗадолженности,
		|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности КАК ДопустимаяСуммаЗадолженности,
		|	ДоговорыКонтрагентов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	ДоговорыКонтрагентов.ЗапрещаетсяПросроченнаяЗадолженность КАК ЗапрещаетсяПросроченнаяЗадолженность,
		|	ДоговорыКонтрагентов.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ДоговорыКонтрагентов.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
		|	ДоговорыКонтрагентов.ИспользуетсяПриОбменеДанными КАК ИспользуетсяПриОбменеДанными,
		|	ДоговорыКонтрагентов.бит_СостояниеДоговора КАК бит_СостояниеДоговора,
		|	ДоговорыКонтрагентов.бит_ПредметДоговора КАК бит_ПредметДоговора,
		|	ДоговорыКонтрагентов.бит_ОписаниеРабот КАК бит_ОписаниеРабот,
		|	ДоговорыКонтрагентов.бит_ОсновнаяСтатьяОборотов КАК бит_ОсновнаяСтатьяОборотов,
		|	ДоговорыКонтрагентов.бит_ОсновнаяСтатьяОборотовБДР КАК бит_ОсновнаяСтатьяОборотовБДР,
		|	ДоговорыКонтрагентов.бит_ЦФО КАК бит_ЦФО,
		|	ДоговорыКонтрагентов.бит_Проект КАК бит_Проект,
		|	ДоговорыКонтрагентов.бит_СуммаДоговора КАК бит_СуммаДоговора,
		|	ДоговорыКонтрагентов.бит_ТипДоговора КАК бит_ТипДоговора,
		|	ДоговорыКонтрагентов.бит_НаправлениеДоговора КАК бит_НаправлениеДоговора,
		|	ДоговорыКонтрагентов.бит_ПодразделениеОрганизации КАК бит_ПодразделениеОрганизации,
		|	ДоговорыКонтрагентов.бит_СпособРасчетаФинПлатежей КАК бит_СпособРасчетаФинПлатежей,
		|	ДоговорыКонтрагентов.бит_ВысокийПриоритетПриЗаполненииАналитик КАК бит_ВысокийПриоритетПриЗаполненииАналитик,
		|	ДоговорыКонтрагентов.бит_СтадияДоговора КАК бит_СтадияДоговора,
		|	ДоговорыКонтрагентов.бит_ВключатьВРеестрДоговоров КАК бит_ВключатьВРеестрДоговоров,
		|	ДоговорыКонтрагентов.бит_КурсВзаиморасчетов КАК бит_КурсВзаиморасчетов,
		|	ДоговорыКонтрагентов.бит_КратностьВзаиморасчетов КАК бит_КратностьВзаиморасчетов,
		|	ДоговорыКонтрагентов.бит_СтавкаНДС КАК бит_СтавкаНДС,
		|	ДоговорыКонтрагентов.бит_СуммаНДСВзаиморасчеты КАК бит_СуммаНДСВзаиморасчеты,
		|	ДоговорыКонтрагентов.ДополнительныеРеквизиты.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Свойство КАК Свойство,
		|		Значение КАК Значение,
		|		ТекстоваяСтрока КАК ТекстоваяСтрока
		|	) КАК ДополнительныеРеквизиты,
		|	ДоговорыКонтрагентов.бит_СтатьиОборотов.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		РасходДоход КАК РасходДоход,
		|		СтатьяОборотов КАК СтатьяОборотов
		|	) КАК бит_СтатьиОборотов,
		|	ДоговорыКонтрагентов.Предопределенный КАК Предопределенный,
		|	ДоговорыКонтрагентов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	NULL КАК БанковскийСчетПолучателя,
		|	NULL КАК ОрганизацияПолучатель,
		|	NULL КАК СтатьяДвиженияДенежныхСредствПолучателя,
		|	NULL КАК НаправлениеДеятельности,
		|	NULL КАК УстановленСрокОплаты,
		|	NULL КАК СрокОплаты,
		|	NULL КАК СтавкаНДС,
		|	NULL КАК ДоговорСУчастникомГОЗ,
		|	NULL КАК ГосударственныйКонтракт,
		|	NULL КАК ПлатежиПо275ФЗ,
		|	NULL КАК ТипПлатежаФЗ275,
		|	NULL КАК ПроцентОплатыЗаСчетСобственныхСредств,
		|	NULL КАК РаспределениеОплатПоБанковскимСчетам,
		|	NULL КАК СуммаПрибыли,
		|	NULL КАК Сумма,
		|	ПУСТАЯТАБЛИЦА.( КАК Ссылка,  КАК НомерСтроки,  КАК ДоговорСЗаказчиком,  КАК Процент) КАК ДоговорыСЗаказчиками,
		|	ПУСТАЯТАБЛИЦА.( КАК Ссылка,  КАК НомерСтроки,  КАК ВидДокумента,  КАК Номер,  КАК Дата,  КАК Сумма,  КАК Файл) КАК ПодтверждающиеДокументы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоговорыКредитовИДепозитов.Ссылка,
		|	ДоговорыКредитовИДепозитов.ВерсияДанных,
		|	ДоговорыКредитовИДепозитов.ПометкаУдаления,
		|	ДоговорыКредитовИДепозитов.Наименование,
		|	ДоговорыКредитовИДепозитов.БанковскийСчет,
		|	ДоговорыКредитовИДепозитов.бит_ДержательДоговора,
		|	ДоговорыКредитовИДепозитов.БанковскийСчетКонтрагента,
		|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
		|	ДоговорыКредитовИДепозитов.Комментарий,
		|	ДоговорыКредитовИДепозитов.ДатаПервогоТранша,
		|	ДоговорыКредитовИДепозитов.ДатаПоследнегоПлатежа,
		|	ДоговорыКредитовИДепозитов.Организация,
		|	ДоговорыКредитовИДепозитов.Контрагент,
		|	ДоговорыКредитовИДепозитов.Ответственный,
		|	ДоговорыКредитовИДепозитов.НаименованиеДляПечати,
		|	NULL,
		|	NULL,
		|	ДоговорыКредитовИДепозитов.Дата,
		|	ДоговорыКредитовИДепозитов.Номер,
		|	ДоговорыКредитовИДепозитов.Партнер,
		|	ДоговорыКредитовИДепозитов.Подразделение,
		|	ДоговорыКредитовИДепозитов.УдалитьПорядокОплаты,
		|	ДоговорыКредитовИДепозитов.ОплатаВВалюте, 
		|	NULL,
		|	ДоговорыКредитовИДепозитов.Согласован,
		|	ДоговорыКредитовИДепозитов.Статус,
		|	NULL,
		|	ДоговорыКредитовИДепозитов.ТипДоговора,
		|	NULL,
		|	NULL,
		|	ДоговорыКредитовИДепозитов.ГруппаФинансовогоУчета,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДоговорыКредитовИДепозитов.бит_СостояниеДоговора,
		|	ДоговорыКредитовИДепозитов.бит_ПредметДоговора,
		|	ДоговорыКредитовИДепозитов.бит_ОписаниеРабот,
		|	ДоговорыКредитовИДепозитов.бит_ОсновнаяСтатьяОборотов,
		|	ДоговорыКредитовИДепозитов.бит_ОсновнаяСтатьяОборотовБДР,
		|	ДоговорыКредитовИДепозитов.бит_ЦФО,
		|	ДоговорыКредитовИДепозитов.бит_Проект,
		|	ДоговорыКредитовИДепозитов.бит_СуммаДоговора,
		|	ДоговорыКредитовИДепозитов.бит_ТипДоговора,
		|	ДоговорыКредитовИДепозитов.бит_НаправлениеДоговора,
		|	ДоговорыКредитовИДепозитов.бит_ПодразделениеОрганизации,
		|	ДоговорыКредитовИДепозитов.бит_СпособРасчетаФинПлатежей,
		|	ДоговорыКредитовИДепозитов.бит_ВысокийПриоритетПриЗаполненииАналитик,
		|	NULL,
		|	ДоговорыКредитовИДепозитов.бит_ВключатьВРеестрДоговоров,
		|	ДоговорыКредитовИДепозитов.бит_КурсВзаиморасчетов,
		|	ДоговорыКредитовИДепозитов.бит_КратностьВзаиморасчетов,
		|	ДоговорыКредитовИДепозитов.бит_СтавкаНДС,
		|	ДоговорыКредитовИДепозитов.бит_СуммаНДСВзаиморасчеты,
		|	ДоговорыКредитовИДепозитов.ДополнительныеРеквизиты.(
		|		Ссылка,
		|		НомерСтроки,
		|		Свойство,
		|		Значение,
		|		ТекстоваяСтрока
		|	),
		|	ДоговорыКредитовИДепозитов.бит_СтатьиОборотов.(
		|		Ссылка,
		|		НомерСтроки,
		|		РасходДоход,
		|		СтатьяОборотов
		|	),
		|	ДоговорыКредитовИДепозитов.Предопределенный,
		|	ДоговорыКредитовИДепозитов.ИмяПредопределенныхДанных,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ПУСТАЯТАБЛИЦА.(, , , ),
		|	ПУСТАЯТАБЛИЦА.(, , , , , , )
		|ИЗ
		|	Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоговорыАренды.Ссылка,
		|	ДоговорыАренды.ВерсияДанных,
		|	ДоговорыАренды.ПометкаУдаления,
		|	ДоговорыАренды.Наименование,
		|	ДоговорыАренды.БанковскийСчет,
		|	ДоговорыАренды.бит_ДержательДоговора,
		|	ДоговорыАренды.БанковскийСчетКонтрагента,
		|	ДоговорыАренды.ВалютаВзаиморасчетов,
		|	ДоговорыАренды.Комментарий,
		|	ДоговорыАренды.ДатаНачалаДействия,
		|	ДоговорыАренды.ДатаОкончанияДействия,
		|	ДоговорыАренды.Организация,
		|	ДоговорыАренды.Контрагент,
		|	ДоговорыАренды.Ответственный,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДоговорыАренды.Дата,
		|	ДоговорыАренды.Номер,
		|	ДоговорыАренды.Партнер,
		|	ДоговорыАренды.Подразделение,
		|	ДоговорыАренды.УдалитьПорядокОплаты,
		|	ДоговорыАренды.ОплатаВВалюте,
		|	NULL,
		|	ДоговорыАренды.Согласован,
		|	ДоговорыАренды.Статус,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДоговорыАренды.КонтактноеЛицо,
		|	ДоговорыАренды.СтатьяДвиженияДенежныхСредств,
		|	NULL,
		|	NULL,
		|	ДоговорыАренды.бит_СостояниеДоговора,
		|	ДоговорыАренды.бит_ПредметДоговора,
		|	ДоговорыАренды.бит_ОписаниеРабот,
		|	ДоговорыАренды.бит_ОсновнаяСтатьяОборотов,
		|	ДоговорыАренды.бит_ОсновнаяСтатьяОборотовБДР,
		|	ДоговорыАренды.бит_ЦФО,
		|	ДоговорыАренды.бит_Проект,
		|	ДоговорыАренды.бит_СуммаДоговора,
		|	ДоговорыАренды.бит_ТипДоговора,
		|	ДоговорыАренды.бит_НаправлениеДоговора,
		|	ДоговорыАренды.бит_ПодразделениеОрганизации,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДоговорыАренды.бит_КурсВзаиморасчетов,
		|	ДоговорыАренды.бит_КратностьВзаиморасчетов,
		|	ДоговорыАренды.бит_СтавкаНДС,
		|	ДоговорыАренды.бит_СуммаНДСВзаиморасчеты,
		|	ДоговорыАренды.ДополнительныеРеквизиты.(
		|		Ссылка,
		|		НомерСтроки,
		|		Свойство,
		|		Значение,
		|		ТекстоваяСтрока
		|	),
		|	ДоговорыАренды.бит_СтатьиОборотов.(
		|		Ссылка,
		|		НомерСтроки,
		|		РасходДоход,
		|		СтатьяОборотов
		|	),
		|	ДоговорыАренды.Предопределенный,
		|	ДоговорыАренды.ИмяПредопределенныхДанных,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ПУСТАЯТАБЛИЦА.(, , , ),
		|	ПУСТАЯТАБЛИЦА.(, , , , , , )
		|ИЗ
		|	Справочник.ДоговорыАренды КАК ДоговорыАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоговорыМеждуОрганизациями.Ссылка,
		|	ДоговорыМеждуОрганизациями.ВерсияДанных,
		|	ДоговорыМеждуОрганизациями.ПометкаУдаления,
		|	ДоговорыМеждуОрганизациями.Наименование,
		|	ДоговорыМеждуОрганизациями.БанковскийСчет,
		|	NULL,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.ВалютаВзаиморасчетов,
		|	ДоговорыМеждуОрганизациями.Комментарий,
		|	ДоговорыМеждуОрганизациями.ДатаНачалаДействия,
		|	ДоговорыМеждуОрганизациями.ДатаОкончанияДействия,
		|	ДоговорыМеждуОрганизациями.Организация,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.Менеджер,
		|	ДоговорыМеждуОрганизациями.НаименованиеДляПечати,
		|	NULL,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.Дата,
		|	ДоговорыМеждуОрганизациями.Номер,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.Подразделение,
		|	ДоговорыМеждуОрганизациями.УдалитьПорядокОплаты,
		|	ДоговорыМеждуОрганизациями.ОплатаВВалюте,
		|	ДоговорыМеждуОрганизациями.ПорядокРасчетов,
		|	ДоговорыМеждуОрганизациями.Согласован,
		|	ДоговорыМеждуОрганизациями.Статус,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.ТипДоговора,
		|	NULL,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.ГруппаФинансовогоУчета,
		|	NULL,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.СтатьяДвиженияДенежныхСредств,
		|	ДоговорыМеждуОрганизациями.ИдентификаторПлатежа,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.ДополнительныеРеквизиты.(
		|		Ссылка,
		|		НомерСтроки,
		|		Свойство,
		|		Значение,
		|		ТекстоваяСтрока
		|	),
		|	ПУСТАЯТАБЛИЦА.(, , , ),
		|	ДоговорыМеждуОрганизациями.Предопределенный,
		|	ДоговорыМеждуОрганизациями.ИмяПредопределенныхДанных,
		|	ДоговорыМеждуОрганизациями.БанковскийСчетПолучателя,
		|	ДоговорыМеждуОрганизациями.ОрганизацияПолучатель,
		|	ДоговорыМеждуОрганизациями.СтатьяДвиженияДенежныхСредствПолучателя,
		|	ДоговорыМеждуОрганизациями.НаправлениеДеятельности,
		|	ДоговорыМеждуОрганизациями.УстановленСрокОплаты,
		|	ДоговорыМеждуОрганизациями.СрокОплаты,
		|	ДоговорыМеждуОрганизациями.СтавкаНДС,
		|	ДоговорыМеждуОрганизациями.ДоговорСУчастникомГОЗ,
		|	ДоговорыМеждуОрганизациями.ГосударственныйКонтракт,
		|	ДоговорыМеждуОрганизациями.ПлатежиПо275ФЗ,
		|	ДоговорыМеждуОрганизациями.ТипПлатежаФЗ275,
		|	NULL,
		|	NULL,
		|	ДоговорыМеждуОрганизациями.СуммаПрибыли,
		|	ДоговорыМеждуОрганизациями.Сумма,
		|	ДоговорыМеждуОрганизациями.ДоговорыСЗаказчиками.(
		|		Ссылка,
		|		НомерСтроки,
		|		ДоговорСЗаказчиком,
		|		Процент
		|	),
		|	ДоговорыМеждуОрганизациями.ПодтверждающиеДокументы.(
		|		Ссылка,
		|		НомерСтроки,
		|		ВидДокумента,
		|		Номер,
		|		Дата,
		|		Сумма,
		|		Файл
		|	)
		|ИЗ
		|	Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями";
	ИначеЕсли ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СтатусыОбъектов.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ПустаяСсылка)) КАК Статус,
		|	ЕСТЬNULL(СостоянияОплаты.Статус, ЗНАЧЕНИЕ(Справочник.бит_СтатусыОбъектов.ПустаяСсылка)) КАК Оплата
		|ИЗ
		|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежнаяПозиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СтатусыОбъектов
		|		ПО ПлатежнаяПозиция.Ссылка = СтатусыОбъектов.Объект
		|			И (СтатусыОбъектов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтатусыОбъектов КАК СостоянияОплаты
		|		ПО ПлатежнаяПозиция.Ссылка = СостоянияОплаты.Объект
		|			И (СостоянияОплаты.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.СостояниеОплаты))";
	КонецЕсли;
	// -- ЕРП 
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		// Создаем СКД по запросу.
		СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		
		АдресКомпоновки = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);		
		
		// Инициализируем компоновщик.
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновки);
		Попытка
			Компоновщик.Инициализировать(ИсточникНастроек);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось инициализировать компоновщик для отбора. Попробуйте обновить текст запроса. Описание ошибки: %1.';
								  |en='Failed to initialize builder for selection. Try refreshing the query text. Description of error: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры // ИнициализироватьКомпоновщик()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
